from classes.hh.get_info_from_hh import Vacancy
from functions.function import user_interaction

if __name__ == "__main__":
   user_interaction()
  # ds = input()
  # vacancy = [
  #     {
  #         "id вакансии": "83528831",
  #         "Название вакансии": "Стажер-программист",
  #         "Дата публикации": "07-17-2023",
  #         "https cсылка": "https://api.hh.ru/vacancies/83528831?host=hh.ru",
  #         "Заработная плата": "Не указано",
  #         "Город": "Набережные Челны",
  #         "Требование": "У вас есть базовые знания по одному из направлений: <highlighttext>Python</highlighttext>, JavaScript, Dart. Вы хотите получить опыт работы и развивать знания...",
  #         "Обязанности": "Учиться и работать с информацией. Искать и находить информацию. Самостоятельно выбирать вариант решения задачи. Понимать потребности заказчика. Работать в команде..."
  #     },
  #     {
  #         "id вакансии": "83511161",
  #         "Название вакансии": "Аналитик данных ML/ Data Science",
  #         "Дата публикации": "07-17-2023",
  #         "https cсылка": "https://api.hh.ru/vacancies/83511161?host=hh.ru",
  #         "Заработная плата": "Не указано",
  #         "Город": "Москва",
  #         "Требование": "Уверенное владение <highlighttext>Python</highlighttext> и SQL. Знание стека работы с данными (numpy, pandas, scipy, matplotlib). Знание ML-стека <highlighttext>Python</highlighttext> (XGBoost, Scikit...",
  #         "Обязанности": "Разработка моделей для решения задач с использованием методов машинного обучения. Подготовка датафреймов для обучения. Встраивание моделей в существующие операционные процессы. "
  #     }
  # ]
  # for x in vacancy:
  #     if x['id вакансии'] == ds:
  #       for key, value in x.items():
  #         print(key, value)



